src/ChartsOfCharacteristicTypes/ВидыАналитик/ВидыАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыАналитик</name>
  <type>
    <types>CatalogRef.Пользователи</types>
    <types>Boolean</types>
    <types>CatalogRef.Контакты</types>
    <types>CatalogRef.СтатьиРасходов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
    <types>CatalogRef.КошелькиИСчета</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.Долги</types>
    <types>Number</types>
    <types>CatalogRef.СтатьиДоходов</types>
    <types>CatalogRef.ФинансовыеЦели</types>
    <types>CatalogRef.Имущество</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>4</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>Важность</name>
      <description>Важность</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>НаправлениеИспользования</name>
      <description>Где будет использоваться</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>ГеографияСделки</name>
      <description>География сделки</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <type>
        <types>CatalogRef.Имущество</types>
      </type>
    </items>
    <items>
      <name>КарточкаСкидок</name>
      <description>Карточка скидок</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>Кредит</name>
      <description>Кредит</description>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </items>
    <items>
      <name>МестоПолученияДохода</name>
      <description>Место получения дохода</description>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </items>
    <items>
      <name>МестоТраты</name>
      <description>Место траты (магазин, кафе)</description>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </items>
    <items>
      <name>Пометка</name>
      <description>Пометка</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>Проект</name>
      <description>Проект</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>ФинансоваяЦель</name>
      <description>Финансовая цель</description>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </items>
    <items>
      <name>ЧленыСемьи</name>
      <description>Члены семьи (назначение затрат, источники доходов)</description>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>АктуальнаДляДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьВШапкеДляДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитикиДохода</name>
    <comment>Значение по умолчанию в доходах</comment>
    <type>
      <types>Characteristic.ВидыАналитик</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеНастройкиДляДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальнаДляРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьВШапкеДляРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитикиРасхода</name>
    <comment>Значение по умолчанию в расходах</comment>
    <type>
      <types>Characteristic.ВидыАналитик</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеНастройкиДляРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоУмолчанию</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/ChartsOfCharacteristicTypes/ВидыАналитик/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		УправлениеФормой();
	КонецЕсли; 
	
	// Общие настройки форм элементов справочников
	РаботаСФормамиСправочников.ФормаЭлементаПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИмяПВХ = Неопределено;
	Ссылка = Неопределено;
	Если ИмяСобытия = "Записан вид характеристик" И ТипЗнч(Параметр) = Тип("Структура")
		 И Параметр.Свойство("ИмяПланаВидовХарактеристик", ИмяПВХ) И ИмяПВХ = "ВидыАналитик" 
		 И Параметр.Свойство("Ссылка", Ссылка) И Ссылка = Объект.Ссылка Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПереключательРасширенныеНастройкиДляРасхода = Объект.РасширенныеНастройкиДляРасхода;
	ПереключательРасширенныеНастройкиДляДохода =  Объект.РасширенныеНастройкиДляДохода;
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	УправлениеФормой();
	
	//СохраненныйФлагДляДоходов  = ТекущийОбъект.ОбщееДляВсехСтатейДохода;
	//СохраненныйФлагДляРасходов = ТекущийОбъект.ОбщееДляВсехСтатейРасхода;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записан вид характеристик", Новый Структура("ИмяПланаВидовХарактеристик,Ссылка,ВладелецФормы", "ВидыАналитик", Объект.Ссылка, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	
	УправлениеФормой();
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АктуальнаДляРасходаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРасширенныеНастройкиДляРасходаПриИзменении(Элемент)
	
	Объект.РасширенныеНастройкиДляРасхода = ПереключательРасширенныеНастройкиДляРасхода;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасширенныеНастройкиДляРасходаНажатие(Элемент)
	
	ОткрытьФормуПослеПроверкиИЗаписи("ПланВидовХарактеристик.ВидыАналитик.Форма.НастройкиВидимостиПоСтатьям", Новый Структура("ВидАналитики, ЭтоРасход", Объект.Ссылка, Истина), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальнаДляДоходаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРасширенныеНастройкиДляДоходаПриИзменении(Элемент)
	
	Объект.РасширенныеНастройкиДляДохода = ПереключательРасширенныеНастройкиДляДохода;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасширенныеНастройкиДляДоходаНажатие(Элемент)
	
	ОткрытьФормуПослеПроверкиИЗаписи("ПланВидовХарактеристик.ВидыАналитик.Форма.НастройкиВидимостиПоСтатьям", Новый Структура("ВидАналитики, ЭтоРасход", Объект.Ссылка, Ложь), Элемент);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()

	Элементы.ЗначениеАналитикиРасхода.Доступность                   = Объект.АктуальнаДляРасхода;
	Элементы.ГруппаРасширенныеНастройкиДляРасхода.Доступность       = Объект.АктуальнаДляРасхода;
	Элементы.НадписьРасширенныеНастройкиДляРасхода.Доступность      = Объект.АктуальнаДляРасхода И Объект.РасширенныеНастройкиДляРасхода;
	
	Элементы.ЗначениеАналитикиДохода.Доступность                   = Объект.АктуальнаДляДохода;
	Элементы.ГруппаРасширенныеНастройкиДляДохода.Доступность       = Объект.АктуальнаДляДохода;
	Элементы.НадписьРасширенныеНастройкиДляДохода.Доступность      = Объект.АктуальнаДляДохода И Объект.РасширенныеНастройкиДляДохода;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПослеПроверкиИЗаписи(ИмяФормы, ПараметрыДляФормы, ВладелецДляФормы)

	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Сначала объект необходимо записать. 
								  |Записать и продолжить?'");
		ДополнительныеПараметры = Новый Структура("ИмяФормы, ПараметрыДляФормы, ВладелецДляФормы", ИмяФормы, ПараметрыДляФормы, ВладелецДляФормы); 
		ОбработчикОтвета = Новый ОписаниеОповещения("ОткрытьФормуПослеПроверкиИЗаписиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		ОткрытьФорму(ИмяФормы, ПараметрыДляФормы, ВладелецДляФормы, Объект.Ссылка, ,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПослеПроверкиИЗаписиЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да И Записать() Тогда
		ДополнительныеПараметры.ПараметрыДляФормы.Вставить("ВидАналитики", Объект.Ссылка);
		ОткрытьФорму(ДополнительныеПараметры.ИмяФормы, ДополнительныеПараметры.ПараметрыДляФормы, ДополнительныеПараметры.ВладелецДляФормы);
	КонецЕсли;

КонецПроцедуры
 


#КонецОбласти
